In [4]:
import numpy as np
import pandas as pd

In [5]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'], 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [12]:
# 1
animales = pd.DataFrame(data, index = labels)
animales.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [13]:
# 2
animales[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [41]:
# 3
animales.animal.value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [25]:
# 4
animales.animal.value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [26]:
# 5
animales.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [7]:
raw_data = {'first_name': ['Jason', 'Mary', 'Tina', 'Jake', 'Amy','Anne'], 'last_name': ['Miller', 'Smith', 'Ali', 'Milner', 'Cooze','Lynn'], 'age': [42, np.nan, 36, 24, 73,'23'], 'sex': ['m', np.nan, 'f', 'm', 'f','f'], 'preTestScore': [4, np.nan, np.nan, 2, 3, np.nan], 'postTestScore': [25, np.nan, np.nan, 62, 70, np.nan]}

In [8]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])

In [28]:
df.head()

  first_name last_name  age  sex  preTestScore  postTestScore
0      Jason    Miller   42    m           4.0           25.0
1       Mary     Smith  NaN  NaN           NaN            NaN
2       Tina       Ali   36    f           NaN            NaN
3       Jake    Milner   24    m           2.0           62.0
4        Amy     Cooze   73    f           3.0           70.0

In [32]:
# 0
print(df.isna().sum())
print(df.isna().sum().max())

first_name       0
last_name        0
age              1
sex              1
preTestScore     3
postTestScore    3
dtype: int64
3

In [33]:
# 1
print(df.isna().sum(axis=1))

0    0
1    4
2    2
3    0
4    0
5    2
dtype: int64

In [35]:
# 2
df = df.drop([1])
df.head()

  first_name last_name age sex  preTestScore  postTestScore
0      Jason    Miller  42   m           4.0           25.0
2       Tina       Ali  36   f           NaN            NaN
3       Jake    Milner  24   m           2.0           62.0
4        Amy     Cooze  73   f           3.0           70.0
5       Anne      Lynn  23   f           NaN            NaN

In [37]:
# 3
df_pre_mean = df['preTestScore'].mean()
  
df['preTestScore'].fillna(value = df_pre_mean, inplace=True)
df.head()

  first_name last_name age sex  preTestScore  postTestScore
0      Jason    Miller  42   m           4.0           25.0
2       Tina       Ali  36   f           3.0            NaN
3       Jake    Milner  24   m           2.0           62.0
4        Amy     Cooze  73   f           3.0           70.0
5       Anne      Lynn  23   f           3.0            NaN